In [1]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

In [3]:
serr = Series(np.arange(3),index = ['A','B','C']) #index here is A,B,C . Default value is 
serr

A    0
B    1
C    2
dtype: int32

In [4]:
serr['A']

0

In [5]:
serr[1]

1

In [6]:
serr[:2]

A    0
B    1
dtype: int32

In [7]:
serr[['A','B']]

A    0
B    1
dtype: int32

In [8]:
serr2 = serr*2

In [9]:
serr2

A    0
B    2
C    4
dtype: int32

In [10]:
serr

A    0
B    1
C    2
dtype: int32

In [11]:
serr2[serr2 > 2] #print values > 2 in the serie

C    4
dtype: int32

In [12]:
serr2[serr2 > 2] = 20
serr2

A     0
B     2
C    20
dtype: int32

In [14]:
dataF = DataFrame(np.arange(25).reshape((5,5)),index = ['A','B','C','D','E'],columns = ['col1','col2','col3','col4','col5'])
dataF

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19
E    20    21    22    23    24

In [16]:
dataF['col1']

A     0
B     5
C    10
D    15
E    20
Name: col1, dtype: int32

In [17]:
dataF[['col1','col5']]

   col1  col5
A     0     4
B     5     9
C    10    14
D    15    19
E    20    24

In [18]:
dataF[dataF['col1']>6]

   col1  col2  col3  col4  col5
C    10    11    12    13    14
D    15    16    17    18    19
E    20    21    22    23    24